app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "tuongvule@gmail.com"], ["LIMIT", 1]]
---
  def load_user
    @user = User.find_by email: params[:session][:email].downcase